app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", ""], ["created_at", "2021-05-18 11:51:54.436522"], ["updated_at", "2021-05-18 11:51:54.436522"]]
---
    def create
        SchoolClass.create(params.require(:school_class).permit(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" ORDER BY "school_classes"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def show
        @show_school_class = SchoolClass.last